In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sn

In [3]:
tuition_cost =pd.read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-03-10/tuition_cost.csv')

tuition_income =pd.read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-03-10/tuition_income.csv') 

salary_potential =pd.read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-03-10/salary_potential.csv')

historical_tuition =pd.read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-03-10/historical_tuition.csv')

diversity_school =pd.read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-03-10/diversity_school.csv')

In [4]:
tuition_cost

,name,state,state_code,type,degree_length,room_and_board,in_state_tuition,in_state_total,out_of_state_tuition,out_of_state_total
0,Aaniiih Nakoda College,Montana,MT,Public,2 Year,NaN,2380,2380,2380,2380
1,Abilene Christian University,Texas,TX,Private,4 Year,10350.0,34850,45200,34850,45200
2,Abraham Baldwin Agricultural College,Georgia,GA,Public,2 Year,8474.0,4128,12602,12550,21024
3,Academy College,Minnesota,MN,For Profit,2 Year,NaN,17661,17661,17661,17661
4,Academy of Art University,California,CA,For Profit,4 Year,16648.0,27810,44458,27810,44458
...,...,...,...,...,...,...,...,...,...,...
2968,York Technical College,South Carolina,SC,Public,2 Year,NaN,5740,5740,12190,12190
2969,Young Harris College,Georgia,GA,Private,4 Year,12372.0,29117,41489,29117,41489
2970,Youngstown State University,Ohio,OH,Public,4 Year,9400.0,8950,18350,14950,24350
2971,Yuba College,California,CA,Public,2 Year,NaN,1400,1400,8420,8420
2972,Zane State College,Ohio,OH,Public,2 Year,NaN,5070,5070,9930,9930

In [5]:
tuition_cost.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2973 entries, 0 to 2972
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   name                  2973 non-null   object
 1   state                 2921 non-null   object
 2   state_code            2973 non-null   object
 3   type                  2973 non-null   object
 4   degree_length         2973 non-null   object
 5   room_and_board        1879 non-null   float64
 6   in_state_tuition      2973 non-null   int64
 7   in_state_total        2973 non-null   int64
 8   out_of_state_tuition  2973 non-null   int64
 9   out_of_state_total    2973 non-null   int64
dtypes: float64(1), int64(4), object(5)
memory usage: 174.3+ KB

In [6]:
tuition_cost.type.value_counts()

Public        1584
Private       1281
For Profit     107
Other            1
Name: type, dtype: int64

In [7]:
tuition_cost.degree_length.value_counts()

4 Year    1852
2 Year    1120
Other        1
Name: degree_length, dtype: int64

In [8]:
tuition_cost.room_and_board.value_counts()

10200.0    8
6000.0     8
7700.0     7
9900.0     7
7400.0     7
          ..
14660.0    1
11166.0    1
8026.0     1
8830.0     1
6172.0     1
Name: room_and_board, Length: 1428, dtype: int64

Les questions à répondre:
1.